{{--
-------------------------------------------------------------------------------------
   「お気に入り登録」もしくは「お気に入り解除」ボタンを表示
-------------------------------------------------------------------------------------
--}}

{{-- ----------  ログインユーザーが既にお気に入り登録をしていた場合 ---------- --}}
@if (Auth::user()->is_favorite($enquete->id))
    {{-- ---------- 「お気に入り解除」ボタンを表示 ---------- --}}
    {!! Form::open(['route' => ['favorites.unfavorite', $enquete->id], 'method' => 'delete']) !!}
        {!! Form::submit('お気に入り解除', ['class' => "btn btn-outline-secondary"]) !!}
    {!! Form::close() !!}
{{-- ----------  ログインユーザーがまだお気に入り登録をしていない場合 ---------- --}}
@else
    {{-- ---------- 「お気に入り登録」ボタンを表示 ---------- --}}
    {!! Form::open(['route' => ['favorites.favorite', $enquete->id]]) !!}
        {!! Form::submit('お気に入り登録', ['class' => "btn btn-outline-primary"]) !!}
    {!! Form::close() !!}
@endif